
const ValueAbout = () => {
  return (
    <section className="flex flex-col gap-12">
      <article className="flex flex-col items-center justify-center gap-2">
        <h2
          className="font-semibold"
          style={{ fontSize: "clamp(18px, 5vw, 28px)" }}
        >
          قيمنا الأساسية
        </h2>
        <p>
          المبادئ التي توجه كل سطر من الأكواد البرمجية وكل قرار اتخذناه في ميدان
          العمل.
        </p>
      </article>

      <article
        className="grid gap-6"
        style={{ gridTemplateColumns: "repeat(auto-fit, minmax(300px, 1fr))" }}
      >
        <div className="bg-white rounded-lg px-4 py-3 flex flex-col gap-2 border border-zinc-300">
          <div className="flex items-center justify-center rounded-md bg-[#EFF4FF] w-fit p-3">
            <svg
              width="16"
              height="20"
              viewBox="0 0 16 20"
              fill="none"
              xmlns="http://www.w3.org/2000/svg"
            >
              <path
                d="M8 20C5.68333 19.4167 3.77083 18.0875 2.2625 16.0125C0.754167 13.9375 0 11.6333 0 9.1V3L8 0L16 3V9.1C16 10.5167 15.7583 11.8792 15.275 13.1875C14.7917 14.4958 14.1 15.65 13.2 16.65L10 13.45C9.7 13.6333 9.37917 13.7708 9.0375 13.8625C8.69583 13.9542 8.35 14 8 14C6.9 14 5.95833 13.6083 5.175 12.825C4.39167 12.0417 4 11.1 4 10C4 8.9 4.39167 7.95833 5.175 7.175C5.95833 6.39167 6.9 6 8 6C9.1 6 10.0417 6.39167 10.825 7.175C11.6083 7.95833 12 8.9 12 10C12 10.3667 11.9542 10.7208 11.8625 11.0625C11.7708 11.4042 11.6333 11.7333 11.45 12.05L12.95 13.55C13.2833 12.8667 13.5417 12.15 13.725 11.4C13.9083 10.65 14 9.88333 14 9.1V4.375L8 2.125L2 4.375V9.1C2 11.1167 2.56667 12.95 3.7 14.6C4.83333 16.25 6.26667 17.35 8 17.9C8.43333 17.7667 8.84583 17.5958 9.2375 17.3875C9.62917 17.1792 10.0167 16.9333 10.4 16.65L11.8 18.05C11.25 18.5 10.6542 18.8917 10.0125 19.225C9.37083 19.5583 8.7 19.8167 8 20ZM8 12C8.55 12 9.02083 11.8042 9.4125 11.4125C9.80417 11.0208 10 10.55 10 10C10 9.45 9.80417 8.97917 9.4125 8.5875C9.02083 8.19583 8.55 8 8 8C7.45 8 6.97917 8.19583 6.5875 8.5875C6.19583 8.97917 6 9.45 6 10C6 10.55 6.19583 11.0208 6.5875 11.4125C6.97917 11.8042 7.45 12 8 12Z"
                fill="#004AC6"
              />
            </svg>

          </div>
            <h3 className="text-lg font-semibold">الشفافية المطلقة</h3>

            <p>
              نؤمن بأن الثقة تبدأ بالوضوح. لهذا السبب، نوفر تتبعاً في الوقت
              الفعلي لكل خطوة في رحلة المساعدات، من المستودع إلى يد المستفيد.
            </p>
        </div>

        <div className="bg-white rounded-lg px-4 py-3 flex flex-col gap-2 border border-zinc-300">
          <div className="flex items-center justify-center rounded-md bg-[#EFF4FF] w-fit p-3">
            <svg
              width="20"
              height="19"
              viewBox="0 0 20 19"
              fill="none"
              xmlns="http://www.w3.org/2000/svg"
            >
              <path
                d="M0 19V17H9V5.825C8.56667 5.675 8.19167 5.44167 7.875 5.125C7.55833 4.80833 7.325 4.43333 7.175 4H4L7 11C7 11.8333 6.65833 12.5417 5.975 13.125C5.29167 13.7083 4.46667 14 3.5 14C2.53333 14 1.70833 13.7083 1.025 13.125C0.341667 12.5417 0 11.8333 0 11L3 4H1V2H7.175C7.375 1.41667 7.73333 0.9375 8.25 0.5625C8.76667 0.1875 9.35 0 10 0C10.65 0 11.2333 0.1875 11.75 0.5625C12.2667 0.9375 12.625 1.41667 12.825 2H19V4H17L20 11C20 11.8333 19.6583 12.5417 18.975 13.125C18.2917 13.7083 17.4667 14 16.5 14C15.5333 14 14.7083 13.7083 14.025 13.125C13.3417 12.5417 13 11.8333 13 11L16 4H12.825C12.675 4.43333 12.4417 4.80833 12.125 5.125C11.8083 5.44167 11.4333 5.675 11 5.825V17H20V19H0ZM14.625 11H18.375L16.5 6.65L14.625 11ZM1.625 11H5.375L3.5 6.65L1.625 11ZM10 4C10.2833 4 10.5208 3.90417 10.7125 3.7125C10.9042 3.52083 11 3.28333 11 3C11 2.71667 10.9042 2.47917 10.7125 2.2875C10.5208 2.09583 10.2833 2 10 2C9.71667 2 9.47917 2.09583 9.2875 2.2875C9.09583 2.47917 9 2.71667 9 3C9 3.28333 9.09583 3.52083 9.2875 3.7125C9.47917 3.90417 9.71667 4 10 4Z"
                fill="#004AC6"
              />
            </svg>

          </div>
            <h3 className="text-lg font-semibold">العدالة في التوزيع</h3>

            <p>
              نستخدم الخوارزميات الذكية لضمان توزيع المساعدات بناءً على
              الاحتياجات الفعلية والأولويات الإنسانية، بعيداً عن أي تحيز.
            </p>
        </div>

        <div className="bg-white rounded-lg px-4 py-3 flex flex-col gap-2 border border-zinc-300">
          <div className="flex items-center justify-center rounded-md bg-[#EFF4FF] w-fit p-3">
            <svg
              width="16"
              height="20"
              viewBox="0 0 16 20"
              fill="none"
              xmlns="http://www.w3.org/2000/svg"
            >
              <path
                d="M6.55 16.2L11.725 10H7.725L8.45 4.325L3.825 11H7.3L6.55 16.2ZM4 20L5 13H0L9 0H11L10 8H16L6 20H4Z"
                fill="#004AC6"
              />
            </svg>

          </div>
            <h3 className="text-lg font-semibold">الكفاءة التشغيلية</h3>

            <p>
              الوقت حاسم في الكوارث. تم تصميم نظامنا لتقليل البيروقراطية وتسريع
              تدفق الخدمات اللوجستية لإنقاذ المزيد من الأرواح.
            </p>
        </div>
      </article>
    </section>
  );
};

export default ValueAbout;
