
const BenefitsHome = () => {
  return (
    <section className="flex flex-col gap-12 ">
      <div className="relative w-fit py-4 mx-auto">
        <h2 className="text-center font-semibold" style={{fontSize: "clamp(18px, 5vw, 38px)"}}>مميزات منصة RTA</h2>
        <span className="bg-emerald-600 rounded-md w-44 h-1 block absolute  left-1/2 -translate-x-1/2 bottom-0"/>
      </div>

      <article
        className="grid gap-4"
        style={{
          gridTemplateColumns: "repeat(auto-fit, minmax(300px, 1fr))",
        }}
      >
        <div className="bg-white rounded-md p-8 border border-zinc-300 flex flex-col gap-2 items-center justify-center">
          <div className="flex justify-center items-center p-4 rounded-[100px] bg-primary/20">
            <svg
              width="30"
              height="27"
              viewBox="0 0 30 27"
              fill="none"
              xmlns="http://www.w3.org/2000/svg"
            >
              <path
                d="M19.5 27V22.5H13.5V7.5H10.5V12H0V0H10.5V4.5H19.5V0H30V12H19.5V7.5H16.5V19.5H19.5V15H30V27H19.5ZM3 3V9V3ZM22.5 18V24V18ZM22.5 3V9V3ZM22.5 9H27V3H22.5V9ZM22.5 24H27V18H22.5V24ZM3 9H7.5V3H3V9Z"
                fill="#004AC6"
              />
            </svg>
          </div>

          <p className="text-lg font-semibold">خوارزمية العدالة الذكية</p>
          <small className="text-lg">
            نظام متطور يحلل احتياجات العائلات بناءً على الحجم، الموقع، والحالة
            المادية لضمان وصول الدعم لمن هم أكثر حاجة أولاً.
          </small>
        </div>

        <div className="bg-white rounded-md p-8 border border-zinc-300 flex flex-col gap-2 items-center justify-center">
          <div className="flex justify-center items-center p-4 rounded-[100px] bg-[#6CF8BB]/20">
            <svg
              width="33"
              height="33"
              viewBox="0 0 33 33"
              fill="none"
              xmlns="http://www.w3.org/2000/svg"
            >
              <path
                d="M14.925 32.85V29.85C11.8 29.5 9.11875 28.2062 6.88125 25.9688C4.64375 23.7313 3.35 21.05 3 17.925H0V14.925H3C3.35 11.8 4.64375 9.11875 6.88125 6.88125C9.11875 4.64375 11.8 3.35 14.925 3V0H17.925V3C21.05 3.35 23.7313 4.64375 25.9688 6.88125C28.2062 9.11875 29.5 11.8 29.85 14.925H32.85V17.925H29.85C29.5 21.05 28.2062 23.7313 25.9688 25.9688C23.7313 28.2062 21.05 29.5 17.925 29.85V32.85H14.925ZM16.425 26.925C19.325 26.925 21.8 25.9 23.85 23.85C25.9 21.8 26.925 19.325 26.925 16.425C26.925 13.525 25.9 11.05 23.85 9C21.8 6.95 19.325 5.925 16.425 5.925C13.525 5.925 11.05 6.95 9 9C6.95 11.05 5.925 13.525 5.925 16.425C5.925 19.325 6.95 21.8 9 23.85C11.05 25.9 13.525 26.925 16.425 26.925ZM16.425 22.425C14.775 22.425 13.3625 21.8375 12.1875 20.6625C11.0125 19.4875 10.425 18.075 10.425 16.425C10.425 14.775 11.0125 13.3625 12.1875 12.1875C13.3625 11.0125 14.775 10.425 16.425 10.425C18.075 10.425 19.4875 11.0125 20.6625 12.1875C21.8375 13.3625 22.425 14.775 22.425 16.425C22.425 18.075 21.8375 19.4875 20.6625 20.6625C19.4875 21.8375 18.075 22.425 16.425 22.425ZM16.425 19.425C17.25 19.425 17.9563 19.1313 18.5438 18.5438C19.1313 17.9563 19.425 17.25 19.425 16.425C19.425 15.6 19.1313 14.8937 18.5438 14.3062C17.9563 13.7188 17.25 13.425 16.425 13.425C15.6 13.425 14.8937 13.7188 14.3062 14.3062C13.7188 14.8937 13.425 15.6 13.425 16.425C13.425 17.25 13.7188 17.9563 14.3062 18.5438C14.8937 19.1313 15.6 19.425 16.425 19.425Z"
                fill="#006C49"
              />
            </svg>
          </div>

          <p className="text-lg font-semibold">تتبع لحظي</p>
          <small className="text-lg">
            تقنية GPS وBlockchain تتيح للمانحين والمنظمات رؤية حركة الشحنات من
            لحظة خروجها حتى تسليمها باليد للمستفيد.
          </small>
        </div>

        <div className="bg-white rounded-md p-8 border border-zinc-300 flex flex-col gap-2 items-center justify-center">
          <div className="flex justify-center items-center p-4 rounded-[100px] bg-zinc-200">
            <svg
              width="36"
              height="30"
              viewBox="0 0 36 30"
              fill="none"
              xmlns="http://www.w3.org/2000/svg"
            >
              <path
                d="M29.625 29.7L15.525 15.525C14.35 15.8 13.2562 16.2125 12.2437 16.7625C11.2312 17.3125 10.325 18 9.525 18.825L6.375 15.6C7.175 14.8 8.0375 14.1 8.9625 13.5C9.8875 12.9 10.875 12.375 11.925 11.925L8.55 8.55C7.525 9.075 6.56875 9.65625 5.68125 10.2937C4.79375 10.9312 3.95 11.65 3.15 12.45L0 9.225C0.8 8.425 1.63125 7.70625 2.49375 7.06875C3.35625 6.43125 4.275 5.825 5.25 5.25L2.1 2.1L4.2 0L31.8 27.6L29.625 29.7ZM18 27.3C16.95 27.3 16.0625 26.9312 15.3375 26.1938C14.6125 25.4563 14.25 24.575 14.25 23.55C14.25 22.5 14.6125 21.6125 15.3375 20.8875C16.0625 20.1625 16.95 19.8 18 19.8C19.05 19.8 19.9375 20.1625 20.6625 20.8875C21.3875 21.6125 21.75 22.5 21.75 23.55C21.75 24.575 21.3875 25.4563 20.6625 26.1938C19.9375 26.9312 19.05 27.3 18 27.3ZM26.85 18.375C26.425 17.95 26.0625 17.5875 25.7625 17.2875C25.4625 16.9875 25.1 16.625 24.675 16.2L19.275 10.8C21.3 11 23.1937 11.5125 24.9562 12.3375C26.7188 13.1625 28.275 14.25 29.625 15.6L26.85 18.375ZM32.85 12.45C30.925 10.525 28.6938 9.01875 26.1562 7.93125C23.6187 6.84375 20.9 6.3 18 6.3C17.475 6.3 16.9688 6.31875 16.4813 6.35625C15.9938 6.39375 15.5 6.45 15 6.525L11.175 2.7C12.275 2.4 13.3938 2.175 14.5312 2.025C15.6687 1.875 16.825 1.8 18 1.8C21.55 1.8 24.8625 2.4625 27.9375 3.7875C31.0125 5.1125 33.7 6.925 36 9.225L32.85 12.45Z"
                fill="#525657"
              />
            </svg>
          </div>

          <p className="text-lg font-semibold">دعم بدون إنترنت</p>
          <small className="text-lg">
            واجهة ميدانية مخصصة لفرق الإغاثة تعمل في ظروف ضعف الاتصال، مع مزامنة
            تلقائية للبيانات فور توفر الشبكة.
          </small>
        </div>
      </article>
    </section>
  );
};

export default BenefitsHome;
